package wdx.cr.quizz;

class WordBase {

    public static int maxScore(int[] arr) {

        int j=0;
        for (int i = 1; i < 51; i++) {
            if (arr[j]<arr[i]) j=i;
        }
        return(j);
    }

    public static String[][]  base(){
        final String data[][] = new String[51][8];
                    //Название                   летуч                 оруж            магия             такт               расса            очеред            надо
        data[0][0]="Дракончик";               data[0][1]="1";    data[0][2]="1";   data[0][3]="1";   data[0][4]="1";   data[0][5]="0";   data[0][6]="3";   data[0][7]="2";
        data[1][0]="Летучие мыши";            data[1][1]="1";    data[1][2]="3";   data[1][3]="3";   data[1][4]="0";   data[1][5]="0";   data[1][6]="2";   data[1][7]="0";
        data[2][0]="Адская гончая";           data[2][1]="1";    data[2][2]="3";   data[2][3]="3";   data[2][4]="3";   data[2][5]="0";   data[2][6]="1";   data[2][7]="3";
        data[3][0]="Шар";                     data[3][1]="1";    data[3][2]="2";   data[3][3]="1";   data[3][4]="1";   data[3][5]="3";   data[3][6]="1";   data[3][7]="2";
        data[4][0]="Летучка";                 data[4][1]="1";    data[4][2]="2";   data[4][3]="0";   data[4][4]="1";   data[4][5]="2";   data[4][6]="0";   data[4][7]="0";
        data[5][0]="Пламенный дракон";        data[5][1]="1";    data[5][2]="1";   data[5][3]="1";   data[5][4]="3";   data[5][5]="0";   data[5][6]="0";   data[5][7]="0";
        data[6][0]="Миньоны";                 data[6][1]="1";    data[6][2]="3";   data[6][3]="2";   data[6][4]="0";   data[6][5]="0";   data[6][6]="2";   data[6][7]="0";
        data[7][0]="Мегаминьон";              data[7][1]="1";    data[7][2]="3";   data[7][3]="3";   data[7][4]="1";   data[7][5]="0";   data[7][6]="0";   data[7][7]="3";
        data[8][0]="Скелеты";                 data[8][1]="0";    data[8][2]="0";   data[8][3]="3";   data[8][4]="0";   data[8][5]="3";   data[8][6]="2";   data[8][7]="0";
        data[9][0]="Гоблины";                 data[9][1]="0";    data[9][2]="0";   data[9][3]="0";   data[9][4]="0";   data[9][5]="1";   data[9][6]="2";   data[9][7]="1";
        data[10][0]="Рыцарь";                 data[10][1]="0";   data[10][2]="0";  data[10][3]="0";  data[10][4]="2";  data[10][5]="1";  data[10][6]="0";  data[10][7]="3";
        data[11][0]="Стражи";                 data[11][1]="0";   data[11][2]="0";  data[11][3]="3";  data[11][4]="0";  data[11][5]="3";  data[11][6]="2";  data[11][7]="3";
        data[12][0]="Шахтер";                 data[12][1]="0";   data[12][2]="0";  data[12][3]="0";  data[12][4]="3";  data[12][5]="1";  data[12][6]="0";  data[12][7]="0";
        data[13][0]="Валькирия";              data[13][1]="0";   data[13][2]="0";  data[13][3]="0";  data[13][4]="2";  data[13][5]="1";  data[13][6]="3";  data[13][7]="2";
        data[14][0]="Дровосек";               data[14][1]="0";   data[14][2]="0";  data[14][3]="1";  data[14][4]="3";  data[14][5]="1";  data[14][6]="0";  data[14][7]="2";
        data[15][0]="Темный принц";           data[15][1]="0";   data[15][2]="0";  data[15][3]="3";  data[15][4]="2";  data[15][5]="1";  data[15][6]="3";  data[15][7]="3";
        data[16][0]="Мегарыцарь";             data[16][1]="0";   data[16][2]="0";  data[16][3]="3";  data[16][4]="3";  data[16][5]="1";  data[16][6]="3";  data[16][7]="3";
        data[17][0]="П.Е.К.К.А";              data[17][1]="0";   data[17][2]="0";  data[17][3]="3";  data[17][4]="2";  data[17][5]="2";  data[17][6]="0";  data[17][7]="2";
        data[18][0]="Королевские рекруты";    data[18][1]="0";   data[18][2]="0";  data[18][3]="0";  data[18][4]="0";  data[18][5]="1";  data[18][6]="2";  data[18][7]="3";
        data[19][0]="Принц";                  data[19][1]="0";   data[19][2]="0";  data[19][3]="0";  data[19][4]="2";  data[19][5]="1";  data[19][6]="0";  data[19][7]="3";
        data[20][0]="Всадник на кабане";      data[20][1]="0";   data[20][2]="0";  data[20][3]="0";  data[20][4]="2";  data[20][5]="1";  data[20][6]="1";  data[20][7]="0";
        data[21][0]="Мини-П.Е.К.К.А";         data[21][1]="0";   data[21][2]="0";  data[21][3]="3";  data[21][4]="2";  data[21][5]="2";  data[21][6]="0";  data[21][7]="0";
        data[22][0]="Королевский призрак";    data[22][1]="0";   data[22][2]="0";  data[22][3]="2";  data[22][4]="3";  data[22][5]="3";  data[22][6]="0";  data[22][7]="3";
        data[23][0]="Бандитка";               data[23][1]="0";   data[23][2]="0";  data[23][3]="0";  data[23][4]="3";  data[23][5]="1";  data[23][6]="0";  data[23][7]="2";
        data[24][0]="Палач";                  data[24][1]="0";   data[24][2]="0";  data[24][3]="3";  data[24][4]="1";  data[24][5]="1";  data[24][6]="3";  data[24][7]="0";
        data[25][0]="Ледяной дух";            data[25][1]="0";   data[25][2]="3";  data[25][3]="2";  data[25][4]="2";  data[25][5]="3";  data[25][6]="3";  data[25][7]="0";
        data[26][0]="Ледяной голем";          data[26][1]="0";   data[26][2]="3";  data[26][3]="2";  data[26][4]="2";  data[26][5]="3";  data[26][6]="1";  data[26][7]="0";
        data[27][0]="Огненные духи";          data[27][1]="0";   data[27][2]="3";  data[27][3]="1";  data[27][4]="0";  data[27][5]="3";  data[27][6]="2";  data[27][7]="0";
        data[28][0]="Голем";                  data[28][1]="0";   data[28][2]="3";  data[28][3]="0";  data[28][4]="2";  data[28][5]="3";  data[28][6]="1";  data[28][7]="0";
        data[29][0]="Спарки";                 data[29][1]="0";   data[29][2]="3";  data[29][3]="0";  data[29][4]="3";  data[29][5]="2";  data[29][6]="3";  data[29][7]="2";
        data[30][0]="Мини-генераторы";        data[30][1]="0";   data[30][2]="3";  data[30][3]="2";  data[30][4]="1";  data[30][5]="2";  data[30][6]="2";  data[30][7]="0";
        data[31][0]="Варвары";                data[31][1]="0";   data[31][2]="0";  data[31][3]="0";  data[31][4]="2";  data[31][5]="1";  data[31][6]="2";  data[31][7]="0";
        data[32][0]="Гигант";                 data[32][1]="0";   data[32][2]="3";  data[32][3]="0";  data[32][4]="2";  data[32][5]="1";  data[32][6]="1";  data[32][7]="0";
        data[33][0]="Королевские кабаны";     data[33][1]="0";   data[33][2]="3";  data[33][3]="0";  data[33][4]="0";  data[33][5]="0";  data[33][6]="1";  data[33][7]="3";
        data[34][0]="Элитные варвары";        data[34][1]="0";   data[34][2]="0";  data[34][3]="0";  data[34][4]="0";  data[34][5]="1";  data[34][6]="2";  data[34][7]="2";
        data[35][0]="Гигантский скелет";      data[35][1]="0";   data[35][2]="3";  data[35][3]="3";  data[35][4]="2";  data[35][5]="3";  data[35][6]="0";  data[35][7]="0";
        data[36][0]="Вышибала";               data[36][1]="0";   data[36][2]="3";  data[36][3]="2";  data[36][4]="1";  data[36][5]="1";  data[36][6]="3";  data[36][7]="2";
        data[37][0]="Подрывник";              data[37][1]="0";   data[37][2]="2";  data[37][3]="1";  data[37][4]="1";  data[37][5]="3";  data[37][6]="3";  data[37][7]="0";
        data[38][0]="Лучницы";                data[38][1]="0";   data[38][2]="2";  data[38][3]="0";  data[38][4]="1";  data[38][5]="1";  data[38][6]="2";  data[38][7]="0";
        data[39][0]="Гоблин с дротиками";     data[39][1]="0";   data[39][2]="2";  data[39][3]="0";  data[39][4]="1";  data[39][5]="1";  data[39][6]="0";  data[39][7]="1";
        data[40][0]="Принцесса";              data[40][1]="0";   data[40][2]="2";  data[40][3]="1";  data[40][4]="3";  data[40][5]="1";  data[40][6]="3";  data[40][7]="3";
        data[41][0]="Охотник";                data[41][1]="0";   data[41][2]="2";  data[41][3]="0";  data[41][4]="1";  data[41][5]="1";  data[41][6]="3";  data[41][7]="0";
        data[42][0]="Мушкетер";               data[42][1]="0";   data[42][2]="2";  data[42][3]="0";  data[42][4]="1";  data[42][5]="1";  data[42][6]="0";  data[42][7]="0";
        data[43][0]="Королевский гигант";     data[43][1]="0";   data[43][2]="2";  data[43][3]="0";  data[43][4]="1";  data[43][5]="1";  data[43][6]="1";  data[43][7]="3";
        data[44][0]="Гоблины-копейщики";      data[44][1]="0";   data[44][2]="2";  data[44][3]="0";  data[44][4]="1";  data[44][5]="1";  data[44][6]="2";  data[44][7]="1";
        data[45][0]="Ледяной колдун";         data[45][1]="0";   data[45][2]="1";  data[45][3]="2";  data[45][4]="3";  data[45][5]="1";  data[45][6]="3";  data[45][7]="0";
        data[46][0]="Магический лучник";      data[46][1]="0";   data[46][2]="1";  data[46][3]="0";  data[46][4]="3";  data[46][5]="1";  data[46][6]="3";  data[46][7]="0";
        data[47][0]="Ночная ведьма";          data[47][1]="0";   data[47][2]="1";  data[47][3]="3";  data[47][4]="3";  data[47][5]="1";  data[47][6]="3";  data[47][7]="0";
        data[48][0]="Громовержец";            data[48][1]="0";   data[48][2]="1";  data[48][3]="2";  data[48][4]="3";  data[48][5]="1";  data[48][6]="3";  data[48][7]="0";
        data[49][0]="Ведьма";                 data[49][1]="0";   data[49][2]="1";  data[49][3]="3";  data[49][4]="1";  data[49][5]="1";  data[49][6]="3";  data[49][7]="0";
        data[50][0]="Колдун";                 data[50][1]="0";   data[50][2]="1";  data[50][3]="1";  data[50][4]="1";  data[50][5]="1";  data[50][6]="3";  data[50][7]="2";

        return(data);
    }

    public static String resAccuracy(int arr[]) {
        String accuracy=(" ");
        int j=maxScore(arr);
        if (arr[j]==1) {accuracy="40%";}
        if (arr[j]==2) {accuracy="50%";}
        if (arr[j]==3) {accuracy="75%";}
        if (arr[j]==4) {accuracy="90%";}
        if (arr[j]==5) {accuracy="100%";}
        if (arr[j]==6) {accuracy="110%";}
        if (arr[j]==7) {accuracy="120%";}
        return(accuracy);
    }
}
